[
{"headline": "Over 1.9 Crore Administered Covid Vaccine In India So Far: Centre", "link": "https://www.ndtv.com/india-news/over-1-9-crore-administered-covid-19-vaccine-in-india-so-far-centre-2384673", "article": "The next phase of COVID-19 vaccination commenced from March 1 (File)\n\nThe cumulative number of COVID-19 vaccine doses administered in India has crossed 1.90 crore with 10,34,672 vaccine jabs being given till Friday evening, the Union Health Ministry said.\n\nThe countrywide vaccination drive was rolled out on January 16 with healthcare workers (HCWs) getting inoculated and vaccination of frontline workers (FLWs) starting from February 2.\n\nThe next phase of COVID-19 vaccination commenced from March 1 for people above 60 years and those aged 45 and above with specified comorbid conditions.\n\n\"Total 10,34,672 vaccine doses were given till 7 pm on Friday, the forty-ninth day of the nationwide COVID-19 vaccination drive. Out of which, 8,25,537 beneficiaries were vaccinated for the first dose and 2,09,135 HCWs and FLWs received the second dose of vaccine as per the provisional report,\" the ministry said, adding that final reports would be completed for the day by late night.\n\nA total of 8,25,537 beneficiaries include 5,00,942 people aged over 60 years and 77,325 individuals aged between 45-60 with specified comorbidities.\n\nA total of 1,90,40,175 vaccine doses have been given, as per the provisional report till Friday 7 pm.\n\nThese include 68,96,529 HCWs who have taken the first dose and 32,94,612 HCWs who have taken the second dose, 62,94,755 FLWs (first dose), 1,23,191 FLWs (second dose), 21,17,862 beneficiaries over 60- years-old and 3,13,226 individuals aged 45 and above with specific comorbidities."},
{"headline": "Man Killed By Tiger; Two Hurt In Bear Attack In Maharashtra", "link": "https://www.ndtv.com/cities/man-killed-by-tiger-two-hurt-in-bear-attack-in-maharashtra-2384669", "article": "The victim's body was recovered by his family members on Thursday: Official (Representational)\n\nA man was killed by a tiger, while two others were injured in an attack by a sloth bear in the forests of Maharashtra's Chandrapur district, a forest official said on Friday.\n\nThe tiger attack took place in the jungle under Chek Ashta of Pombhurna forest range in Central Chanda division late on Wednesday, said NR Praveen, chief conservator of forest, Chandrapur circle.\n\nThe victim Purusottam Madavi, resident of Pombhurna tehsil, had ventured into the jungle to collect some grass when he was attacked and killed by a big cat, the official said.\n\nThe victim's body was recovered by his family members on Thursday morning, he said.\n\nTwo persons were injured in an attack by a sloth bear in Jamanjetti area on Friday, the official said.\n\nThe victims identified as Sunil Lengure (30) and Mahadev Gudettiwar (35) are currently undergoing treatment at a hospital, he added."},
{"headline": "Have Full Faith In Bengal Deputy Election In-Charge: Election Commission", "link": "https://www.ndtv.com/india-news/have-full-faith-in-bengal-deputy-election-in-charge-election-commission-2384664", "article": "The commission has full faith in the integrity and fairness of Sudeep Jain, it said.\n\nRejecting allegations of the Trinamool Congress that Deputy Election Commissioner in-charge of West Bengal Sudeep Jain is biased, the Election Commission on Friday said it has \"full faith in the integrity and fairness\" of the senior official.\n\nThe ruling Trinamool Congress (TMC) in West Bengal had on Thursday demanded the removal of Mr Jain, accusing him of being biased against it and breaking norms of the federal structure.\n\nIn a statement, the poll panel said that all its deputy election commissioners and other officials posted in the commission's headquarters or working in the field are \"discharging their duties strictly as per the Constitution of India and the various extant rules regarding the conduct of elections\".\n\n\"There could be an odd exception here or there in which case the EC (Election Commission) takes corrective action immediately,\" it said.\n\nThe statement said in the immediate case, \"the commission has full faith in the integrity and fairness of Sudeep Jain, DEC\".\n\n\"Unfortunately, it is not for the first time that a concerted campaign is mounted against senior officers of the commission on the eve of or during the process of elections,\" it said.\n\nReferring to allegations made by the TMC about two decisions taken by Mr Jain during the 2019 Lok Sabha polls as deputy election commissioner in-charge at EC for West Bengal elections, the panel said both the decisions were taken by the commission \"in the interest of holding free, fair and peaceful elections\".\n\nThe decisions were implemented by the district election machinery under the supervision of the deputy election commissioner, chief electoral officer, nodal police officer and other senior officials concerned, the EC said.\n\nTMC spokesperson Sougata Roy had said on Thursday that party leader Derek O' Brien has written to the EC demanding that Mr Jain be removed as he has a \"track record\" of being biased against it during the 2019 Lok Sabha polls.\n\n\"During the last parliamentary poll Sudeep Jain had taken several steps which were not only against the norms of the Election Commission but also against those of the federal structure. We don't have any faith in him. We (TMC) apprehend that this time too he will take steps which will either directly or indirectly help the BJP,\" Mr Roy had said at a press conference in Kolkata.\n\nThe assembly election in West Bengal this time, will see a stiff contest between the TMC and the BJP. It will be held in eight phases beginning with polling in 30 seats on March 27.\n\nVotes cast in the poll for all the 294 seats will be counted on May 2."},
{"headline": "Maharashtra Reports Over 10,000 New Covid Cases After Nearly 5 Months", "link": "https://www.ndtv.com/india-news/maharashtra-reports-over-10-000-new-covid-19-cases-after-nearly-5-months-2384657", "article": "Maharashtra's COVID-19 recovery rate is 93.52 per cent. (File)\n\nMaharashtra reported 10,216 new coronavirus cases on Friday, the highest number of single-day cases in nearly five months, which took its overall tally to 21,98,399, a health department official said.\n\nThis is the first time since October 17, 2020, the single-day case count in the state has gone above the 10,000- mark.\n\nOn October 17, the state had reported 10,259 cases. On Wednesday (March 3), there were 9,855 new cases, while Thursday's infection count was 8,998.\n\nThe state's death count rose to 52,393 with 53 fatalities reported on Friday, the official said.\n\nAs 6,467 patients were discharged from hospitals in the last 24 hours, the recovery count increased to 20,55,951.\n\nMaharashtra's COVID-19 recovery rate is 93.52 per cent, while the fatality rate is 2.38 per cent, the official said.\n\nWith 90,550 tests conducted in the last 24 hours, the total test count has risen to 1,66,86,880.\n\nCurrently, 4,10,411 people are in home quarantine and 4,203 people are in institutional quarantine across the state. There are 88,838 active cases of coronavirus.\n\nMumbai reported new 1,174 COVID-19 cases on Friday, which took its tally to 3,31,020, while the death count went up to 11,495 with three fresh fatalities.\n\nAccording to the official, 849 people tested positive in Pune city during the day, which took its tally to 2,13,038 and with four new deaths, the fatality count increased to up to 4,587.\n\nAccording to the official,Nagpur, Pimpri Chinchwad, Nashik, Aurangabad and Amravati cities reported 1,225, 549, 352, 318 and 435 new cases respectively.\n\nOut of 88,838 active COVID-19 patients, the highest 18,401 are in Pune district, followed by Nagpur and Thane with 11,552 and 9,579 patients.\n\nThane circle which includes Mumbai and surrounding areas reported 2,135 new coronavirus cases, taking its tally to 7,35,649, while 11 fresh fatalities took the death count to 19,868.\n\nIn Pune circle, 2,070 new COVID-19 cases were found, increasing the tally to 5,35,172, while seven new fatalities took the death count to 11,779.\n\nWith 1,614 new cases and nine deaths, the tally of COVID-19 cases in Nashik Circle rose to 2,98,435 and death count to 5,295.\n\nIn Kolhapur circle, 79 new cases took the tally to 1,20,205, while the death count increased to 4,074 with two fresh deaths.\n\nWith 1,974 new cases and six new fatalities, the tally of COVID-19 cases in Nagpur circle increased to 2,34,689 and death count to 4,857.\n\nIn Aurangabad circle, 523 new cases took the tally to 82,771, and the death count increased to 2,059 with four new deaths.\n\nWith 349 new cases and five fatalities, the tally of COVID-19 cases in Latur circle increased to 87,469 and death count to 2,545.\n\nIn Akola circle, 1,472 new cases took the tally of COVID-19 cases to 1,03,863, and the death count increased to 1,827 with nine new deaths, the official said.\n\nCoronavirus figures of Maharashtra are as follows: Total cases 21,98,399, New cases 10,216, Death count 52,393, Recoveries 20,55,951, Active cases 88,838, Tests conducted so far 1,66,86,880."},
{"headline": "India On Track To Achieving Climate Goals: PM Modi", "link": "https://www.ndtv.com/india-news/india-on-track-to-achieving-climate-goals-pm-modi-2384656", "article": "PM Modi noted that over the last seven years, India's forest cover has grown significantly. (File)\n\nPrime Minister Narendra Modi on Friday said the country is on track to achieving its climate goals well before the target date as it switches over to energy-efficient mediums and uses waste to generate energy.\n\nSpeaking after accepting the 2021 CERAWeek Global Energy & Environment Leadership Award for his commitment to energy sustainability and the environment, PM Modi said climate change and calamity are major challenges facing the world.\n\nBoth are interlinked, and one way to fight them is through policies, laws, rules and orders, and the other is bringing behavioural change, he said, listing measures taken by his government for sustainable energy usage.\n\nWhile the target of mixing 20 per cent ethanol has been advanced to 2025, 5,000 compressed bio-gas plants will be set up to turn municipal and agriculture waste into energy, he said.\n\nWhile switch over to energy-efficient LED bulbs has helped save 38 million tonnes of carbon emission, modern techniques of irrigation as well as reducing the use of pesticides with greater awareness of improving soil health has greatly helped, he said.\n\nThe share of non-fossil sources in India's installed capacity of electricity has grown to 38 per cent and the nation adopted Bharat-VI emission norms in April last year to cut vehicular pollution.\n\nIndia, he said, is working to increase the share of natural gas, which is environment friendly and less polluting, in the energy basket from the current 6 per cent to 15 per cent by 2030.\n\nAlso, liquefied natural gas (LNG) is being promoted as a fuel.\n\nHe also mentioned of recently launched National Hydrogen Mission and equitable and decentralized model of solar energy generation.\n\n\"India is well on track to achieve its Paris agreement targets well before the target date of 2030,\" he said.\n\nIndia has maintained that it is not a polluter and cause of climate change and has voluntarily committed to reducing greenhouse gas emission intensity of its GDP by 33-35 per cent below 2005 levels by 2030.\n\nOn behavioural changes, PM Modi cited examples such as people embracing LED bulbs, voluntarily giving up LPG subsidy, increased cooking gas coverage and affordable transportation initiatives.\n\nThe Prime Minister noted that over the last seven years, India's forest cover has grown significantly, the population of lions, tigers, leopards and waterfowls has grown.\n\nThese, he said, are great indicators of positive behavioural changes.\n\nAccepting the award, he said, \"It is with great humility that I accept the CERAWeek Global Energy and Environment Leadership Award. I dedicate this award to the people of our great Motherland, India. I dedicate this award to the glorious tradition of our land that has shown the way when it comes to caring for the environment.\"\n\nHe added that Indians are leaders when it comes to caring for the environment for centuries and the nation's culture, nature and divinity are closely linked.\n\nThe Prime Minister said that Mahatma Gandhi is one of the greatest environment champions to have ever lived. \"If humanity had followed the path laid down by him, we would not face many of the problems we do today.\"\n\nHe concluded \"now is the time to think logically and ecologically. After all this is not about me or you. It is about our planet's future. We owe this to our coming generations.\""},
{"headline": "Greta Thunberg's Comments On Farmers' Protests Not Bilateral Issue Between India, Sweden: Ministry", "link": "https://www.ndtv.com/india-news/greta-thunbergs-comments-on-farmers-protests-not-bilateral-issue-between-india-sweden-ministry-2384655", "article": "Greta Thunberg last month said, \"We stand in solidarity with the #FarmersProtest in India,\" on Twitter\n\nYoung Swedish climate activist Greta Thunberg's recent comments on the farmers' protests in India do not form a bilateral issue between India and Sweden, and the matter did not come up during an online summit between the prime ministers of the two countries on Friday, the Ministry of External Affairs said.\n\nAt a special briefing after the summit, Vikas Swarup, Secretary (West) in the ministry, was asked whether the issue of Ms Thunberg's comments on the farmers' protest was taken up by India with Sweden during the meeting.\n\n\"The answer is no. This is not a bilateral issue between India and Sweden,\" Mr Swarup said.\n\nLast month, Ms Thunberg had taken to Twitter to say, \"We stand in solidarity with the #FarmersProtest in India.\"\n\nThis was followed by another tweet a day later, in which she shared \"a toolkit for those who want to help\".\n\nWhile a number of international celebrities, including pop star Rihanna, had also tweeted in support of the farmers' protests, which entered its 100th day on Friday, the ''toolkit'' matter became a major issue with the Delhi Police later registering FIRs against several people for allegedly trying to tarnish India''s image.\n\nThe ''toolkit'' document, listed various actions, including creating a \"Twitter storm\" and protesting outside Indian embassies, to support the farmers'' protest.\n\nIn a statement, the MEA had said last month that some \"vested interest groups\" were trying to enforce their agenda on the protests and that a very small section of farmers in parts of the country has some reservations about the farm reforms which were passed by Parliament after a full debate and discussion.\n\nHowever, the Samyukta Kisan Morcha (SKM), an umbrella body of 41 farm unions spearheading the agitation, had welcomed the support extended by international personalities, saying it was a matter of pride that they are showing sensitivity towards the cause of farmers, but it was unfortunate that the government of India is not understanding their pain.\n\nEmphasising that the protests must be seen in the context of India''s democratic ethos and polity, the MEA in its statement had said some vested interest groups have tried to mobilise international support against the country.\n\nFarmers, mostly from Punjab, Haryana and western Uttar Pradesh, have been camping at several Delhi border points, including Tikri, Singhu and Ghazipur, since November 28, demanding a complete repeal of three farm laws and a legal guarantee on minimum support price (MSP) for their crops.\n\nThe government has denied allegations that it was trying to put an end to the MSP and the mandi system. Prime Minister Narendra Modi has also assured farmers that the MSP would continue."},
{"headline": "Sri Lanka Buries First Covid Victims After Long Standoff", "link": "https://www.ndtv.com/world-news/sri-lanka-buries-first-covid-victims-after-long-standoff-2384649", "article": "The government did not allow burials for almost a year despite protests.\n\nSri Lanka ended its forced cremation policy by allowing the burial of two persons who died due to the COVID-19 pandemic, Army Chief General Shavendra Silva said on Friday.\n\nAmidst mounting international criticism, Sri Lanka revised a controversial mandatory order to cremate the bodies of COVID-19 victims, which denied minority communities, including Muslims, their religious rights.\n\nThe government last month revised a gazette notification issued in April last year. The new notification allowed both burials and cremations.\n\n\"Today we buried two of them and there will be five more to be buried,\" Mr Silva told reporters.\n\nHe said the burials were allowed as per the guidelines for burials issued by the Director General Health Services on Thursday.\n\nThe government did not allow burials for almost a year despite protests from the country's Muslim and Christian religious minorities.\n\nThe policy was also condemned by international rights groups who urged the government to follow the guidelines on COVID-19 dead bodies issued by the WHO, which recommended both cremations and burials.\n\nThe government allowed burials late last month. However, the implementation was held back until the health authorities issued guidelines.\n\nThe government's designated burial site at Iranathivu islet in the north eastern region faced opposition from the residents.\n\nOn Friday, two Muslim-dominated local councils in the eastern region had come forward to provide a burial site and accordingly the two bodies were buried in the Ottamavadi area in the eastern Batticaloa district.\n\nWhen the Iranathivu residents protested against burying the COVID-19 dead there, the government said they were also looking for alternative sites.\n\nThe Muslim and Tamil minority political parties had decried the government's forced cremation policy against the Muslim religious funeral rites as racist.\n\nHowever, the government maintained that burials of victims could endanger the water table.\n\nFor 10 months, the Muslim and Christian minorities in the country and international rights groups lobbied the government to end the policy of forced cremations.\n\nThe cremation of bodies is forbidden in Islam."},
{"headline": "PM Modi To Address Commanders' Conference In Gujarat On March 6", "link": "https://www.ndtv.com/india-news/gujarat-pm-narendra-modi-to-address-commanders-conference-in-kevadia-on-march-6-2384648", "article": "PM Modi will be in Gujarat to address a conference of country's top military leadership (File)\n\nPrime Minister Narendra Modi will be in Gujarat on Saturday to address a conference of the country's top military leadership at Kevadia in Narmada district, a state official said on Friday.\n\nThe Combined Commanders' Conference, a three-day brainstorming meet of top military officials, began in Kevadia on Thursday.\n\n\"The PM would arrive here on Saturday morning to address the gathering. He is scheduled to leave on the same day,\" said a senior official.\n\nDefence Minister Rajnath Singh arrived in Kevadia on Friday to participate in the conference."},
{"headline": "Top Court Seeks Centre's Response Over Blood Donation Ban By Transgenders", "link": "https://www.ndtv.com/india-news/supreme-court-notice-to-centre-on-plea-against-guidelines-excluding-transgenders-from-being-blood-donors-2384647", "article": "\"Issue notice,\" said the bench, also comprising Justices AS Bopanna and V Ramasubramanian.\n\nThe Supreme Court Friday sought responses from the centre and others on a plea challenging the 2017 guidelines excluding transgenders, men having sex with men and female sex workers from being blood donors.\n\nA bench headed by Chief Justice SA Bobde agreed to hear the plea and issued notices to the Centre, the National Blood Transfusion Council (NBTC) and the National AIDS Control Organisation (NACO) seeking their responses on the plea filed by a transgender activist from Manipur.\n\n\"Issue notice,\" said the bench, also comprising Justices AS Bopanna and V Ramasubramanian.\n\nThe plea has also sought striking down of the clause of general criteria under blood donor selection criteria of the guidelines for blood donor selection and blood donor referral, 2017 to the extent it permanently defers transgenders, men having sex with men and female sex workers from being blood donors on account of being at risk of HIV infection.\n\n\"The exclusion of transgender persons, men having sex with men and female sex workers from being blood donors and permanently prohibiting them from donating blood solely on the basis of their gender identity and sexual orientation is completely arbitrary, unreasonable and discriminatory and also unscientific,\" said the plea, filed through advocate Anindita Pujari.\n\nIt said that all blood units collected from donors are tested for infectious diseases including Hepatitis B, Hepatitis C and HIV/AIDS and hence, permanently \"excluding them from donating blood and categorizing them as high-risk only on the basis of their gender identity and sexual orientation is violative of their right to be treated equally as other blood donors.\"\n\nThe plea claimed that the prohibition is due to assumptions based on \"negative stereotypes\" which amounts to discrimination and these persons are denied equal dignity under Article 14 of the Constitution as they are deemed \"less worthy and subordinate\" in social participation and healthcare.\n\nIt said there is more need for blood and plasma donations as blood supplies have come under pressure due to the coronavirus pandemic.\n\n\"Given the COVID-19 crisis, where blood transfusions are needed more than ever for emergency and elective surgeries and treatments, it is more critical than ever for members of the transgender community to rely on the generosity of their family and community members to meet the demands for getting life-saving blood to those affected by the pandemic,\" the plea said.\n\nIt alleged that transgender persons, gay and bisexual men who have been requesting to donate blood during the pandemic when their community and family members needed blood for emergency medical treatment were refused due to the \"permanent deferral under the impugned guidelines.\"\n\nIt claimed these guidelines are \"stigmatizing\" as they are neither based on how HIV transmissions actually works nor are they based on actual risk involved in specific activities but are based only on the identities of donors.\n\nIt said during 1980s when the HIV/AIDS outbreak occurred, in many countries such similar lifetime ban on blood donations on transgenders persons and men who had sex with men was implemented.\n\nHowever, it was due to an outdated policy based on stigma and stereotype associated with transgender persons, men having sex with men and sex workers, the plea said.\n\n\"Now such complete bans have been removed in many countries and now guidelines internationally on blood donation do not have such permanent bans based on identity,\" it said.\n\n\"Many countries have revised their policies to not make deferrals identity based, but based on either a three-month or 45-day deferral from the last high-risk sexual contact,\" the plea said."},
{"headline": "259-Member Panel Constituted To Commemorate 75 Years Of India's Independence", "link": "https://www.ndtv.com/india-news/259-member-panel-constituted-to-commemorate-75-years-of-indias-independence-2384646", "article": "Panel includes dignitaries, eminent citizens from all walks of life, statement said (Representational)\n\nThe government on Friday set up a 259-member high-level national committee, headed by Prime Minister Narendra Modi, to commemorate 75 years of India's independence.\n\nThe members of the panel include former president Pratibha Patil, Chief Justice of India SA Bobde, NSA Ajit Doval, 28 chief ministers, artistes like Lata Mangeshkar, Nobel laureate Amartya Sen, senior BJP leader LK Advani, almost all Union ministers and several governors.\n\nOpposition leaders like Congress chief Sonia Gandhi, CPI(M) general secretary Sitaram Yechury, NCP leader Sharad Pawar, TMC supremo Mamata Banerjee and former Uttar Pradesh chief ministers Mulayam Singh Yadav and Mayawati are also part of the committee.\n\nEarlier, a National Implementation Committee under the chairmanship of Union Home Minister Amit Shah had been constituted for the 75 years independence celebrations. A Committee of Secretaries has also been set up for this purpose.\n\n\"The government has now constituted a national committee under the chairmanship of the Prime Minister of India with 259 members, for which a gazette notification has been issued today,\" an official statement said.\n\nThe panel includes dignitaries and eminent citizens from all walks of life, it added.\n\nThe committee will provide policy direction and guidelines for formulation of programmes for the commemoration of the 75th anniversary of Indian Independence, at the national and international levels, a statement from the union ministry of culture said.\n\nThe celebrations are proposed to be launched 75 weeks prior to August 15, 2022, on March 12, 2021, which is the 91st anniversary of the historic Salt Satyagraha led by Mahatma Gandhi.\n\nIn order to discuss modalities relating to preparatory activities for the celebrations, the high-level committee will hold its first meeting on March 8, according to the statement."},
{"headline": "China To Build Important \"Passageway\" To South Asia Through Tibet: Report", "link": "https://www.ndtv.com/world-news/china-to-build-important-passageway-to-south-asia-through-tibet-report-2384640", "article": "The draft outline of the 14th Five-Year Plan has been submitted to the NPC for formal approval.\n\nChina has included building of an important \"passageway\" connecting Tibet with South Asia in the 14th Five Year plan which is due to commence from this year, the official media reported on Friday.\n\nChina will support Tibet in building the passageway to South Asia, state-run Xinhua news agency reported, quoting the 14th Plan document which was submitted to the National People's Congress, (NPC), China's Parliament.\n\nThe annual session of the NPC began in Beijing on Friday.\n\n\"China's Tibet Autonomous Region will be supported to build an important passageway opening to South Asia,\" state-run Xinhua news agency reported briefly.\n\nThe draft outline of the 14th Five-Year Plan (2021-2025) for national economic and social development and the long-range objectives through the year 2035, which were cleared by the ruling Communist Party of China (CPC) have been submitted to the NPC for formal approval.\n\nThough the Xinhua report has not mentioned, China has been planning for a long time to build the Trans-Himalayan Multi-Dimensional Connectivity Network through Tibet and Nepal.\n\nIt was regarded as a part of the Belt and Road Initiative (BRI) cooperation between China and Nepal.\n\nNepal under the present government of Prime Minister KP Sharma Oli has moved closer to China, firming up especially the trans-Himalayan connectivity network.\n\nIn 2019, China and Nepal signed a protocol to operationalise their 2016 Transit Transport Treaty which provided access for the landlocked Himalayan country to use Chinese ports for its foreign trade, reducing the dependence on Indian ports.\n\nBesides the road network, the two countries are considering the extension of the rail network from Tibet to Nepal.\n\nLast year, state-run China Daily here reported that preparatory work is underway for a cross-border railway connecting Tibet and Nepal's capital, Kathmandu.\n\nMeanwhile, work will start on the China-Nepal Friendship Industrial Park in Jhapa, eastern Nepal, early next year. The park is the first of its kind launched with Chinese investment.\n\nThese two projects form part of the Trans-Himalayan Multi-Dimensional Connectivity Network, the report said.\n\n(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)"},
{"headline": "Desire Normal Ties With Pakistan, All Issues Should Be Resolved Bilaterally: India", "link": "https://www.ndtv.com/india-news/desire-normal-ties-with-pakistan-all-issues-should-be-resolved-bilaterally-india-2384633", "article": "\"Our position on key issues remains unchanged,\" MEA spokesperson Anurag Srivastava\n\nDays after Indian and Pakistani armies agreed to strictly observe all their ceasefire agreements, India on Friday maintained that it desires normal relations with all neighbours, including Pakistan, and asserted all issues between the two countries should be resolved bilaterally and peacefully.\n\nFollowing a hotline discussion between the Directors General of Military Operations (DGMOs) of India and Pakistan last month, the two sides agreed to strict observance of all agreements, understandings and ceasefire along the Line of Control (LoC) and all other sectors.\n\nAsked about the observance of the ceasefire agreement by both sides, Ministry of External (MEA) spokesperson Anurag Srivastava said, \"I will direct you to the Ministry of Defence.\"\n\n\"India desires normal relations with all its neighbours, including Pakistan. We have consistently maintained that issues, if any, between India and Pakistan should be resolved bilaterally and peacefully. Our position on key issues remains unchanged,\" he said.\n\nIndia and Pakistan signed a ceasefire agreement in 2003, but it has hardly been followed in letter and spirit over the past several years with more violations than an observance of the pact.\n\nIndian Army officials have asserted that there would be no let-up in their fight against terrorism or in troops deployment along the borders, following the new commitment that they described as a fresh attempt at peace in the region."},
{"headline": "PM To Address ''Janaushadhi Diwas'' Celebrations On Sunday", "link": "https://www.ndtv.com/india-news/pm-to-address-janaushadhi-diwas-celebrations-on-sunday-2384631", "article": "PM Modi will interact with beneficiaries of ''Pradhan Mantri Bhartiya Janaushadhi Pariyojana''. (File)\n\nPrime Minister Narendra Modi will address the ''Janaushadhi Diwas'' celebrations on Sunday via video conferencing and dedicate to the nation the 7,500th ''Janaushadhi Kendra'' at North Eastern Indira Gandhi Regional Institute of Health and Medical Sciences in Shillong, his office said.\n\nHe will interact with the beneficiaries of ''Pradhan Mantri Bhartiya Janaushadhi Pariyojana'' and also give awards to stakeholders, in recognition of their excellent work.\n\nThe Pradhan Mantri Bhartiya Janaushadhi Pariyojana aims to provide quality medicines at an affordable price, the Prime Minister's Office noted, adding the number of stores under the scheme has grown to 7,499 covering all districts of the country.\n\nSales in the financial year 2020-21 (up to March 4, 2021) has led to a total saving of approximately Rs 3,600 crore for citizens, as these medicines are cheaper by 50-90 per cent than market rates.\n\nThe Prime Minister's Office said that in order to create more awareness about ''Janaushadhi'', an entire week -- from March 1 to March 7 -- is being celebrated as ''Janaushadhi Week'' across the nation, with the theme of ''Jan Aushadhi -- Seva bhi, Rozgar bhi''.\n\nThe last day of the week will be celebrated as ''Janaushadhi Diwas''."},
{"headline": "UK Paper Told To Print Front-Page Notice On Meghan Markle's Legal Win", "link": "https://www.ndtv.com/world-news/uk-paper-told-to-print-front-page-notice-on-meghan-markles-legal-win-2384629", "article": "Meghan Markle was awarded 450,000 pounds as a provisional payment towards her legal costs. (File)\n\nThe Mail On Sunday, part of a UK newspaper group that lost a high-profile privacy case brought by Meghan Markle, must print a front-page statement acknowledging her legal victory, a judge ruled on Friday.\n\nHigh Court judge Mark Warby also ordered Associated Newspapers, which owns the Mail On Sunday and MailOnline website, to publish a notice on page three of the paper stating that it had \"infringed her copyright\".\n\nWarby in February upheld Meghan's claim that Associated Newspapers had breached her privacy and copyright by publishing parts of a 2018 letter she sent to her father Thomas Markle.\n\nThe letter to her estranged father was written a few months after she married Queen Elizabeth II's grandson, Prince Harry, and asked him to stop talking to tabloids and making false claims about her in interviews.\n\nWarby has already ordered Associated Newspapers to make an \"interim payment\" of GBP 450,000 ($627,000) to cover legal costs for the Duchess of Sussex, as Meghan is formally known.\n\nOn Friday he also formally refused its appeal bid, saying the newspaper group had \"no real prospect\" of success.\n\nIn his written ruling, the judge said the front- and third-page statements about Meghan's successful copyright claim would have \"genuine utility\".\n\nHe noted the Associated Newspapers titles involved had \"devoted a very considerable amount of space to the infringing articles, which it continued to publish for over two years\".\n\n\"The wording sought is modest by comparison, and factual in nature,\" Warby added of the notices he was ordering.\n\nMeghan, 39, and 36-year-old Harry, who now live in the United States after stepping down from frontline royal duties last year, have taken legal action against a number of publications, alleging invasion of privacy.\n\nThe couple have been in the headlines all week after becoming embroiled in a transatlantic war of words with Buckingham Palace ahead of their blockbuster interview with Oprah Winfrey, set to air Sunday\n\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"},
{"headline": "Top Court Collegium Approves 10 Names As Permanent Judges Of Allahabad High Court", "link": "https://www.ndtv.com/india-news/supreme-court-collegium-approves-10-names-as-permanent-judges-of-allahabad-high-court-2384624", "article": "CJI Bobde, Justices NV Ramana and RF Nariman are part of the three-member Collegium.\n\nThe Supreme Court Collegium Friday approved the proposal for appointment of 10 Additional Judges of Allahabad High Court as Permanent Judges.\n\nThe Collegium headed by Chief Justice SA Bobde in a meeting approved the proposals which was uploaded on the top court website.\n\nThe names which have been approved are Justices Ali Zamin, Vipin Chandra Dixit, Shekhar Kumar Yadav, Ravi Nath Tilhari, Deepak Verma, Gautam Chowdhary, Shamim Ahmed, Dinesh Pathak, Manish Kumar and Samit Gopal.\n\nBesides CJI Bobde, Justices NV Ramana and RF Nariman are part of the three-member Collegium which takes decision with regard to the high court judges."}
]